app/controllers/api/v1/authors_controller.rb

SELECT "authors".* FROM "authors"
---
      def index
        authors = Author.all

SELECT "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
      def show
        author = Author.find(params[:id])

INSERT INTO "authors" ("name", "nationality", "biography", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Stephen King"], ["nationality", nil], ["biography", nil], ["created_at", "2026-01-21 20:03:30.364306"], ["updated_at", "2026-01-21 20:03:30.364306"]]
---
      def create
        @author = current_user.authors.new(author_params)
        if @author.save

SELECT "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT $2  [["id", 110], ["LIMIT", 1]]
UPDATE "authors" SET "updated_at" = $1 WHERE "authors"."id" = $2  [["updated_at", "2026-01-21 20:03:57.941352"], ["id", 2]]
---
      def update
        @author = Author.find(params[:id])
        if @author.update(author_params)

SELECT "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT $2  [["id", 112], ["LIMIT", 1]]
DELETE FROM "authors" WHERE "authors"."id" = $1  [["id", 112]]
---
      def destroy
        @author = Author.find(params[:id])
        @author.destroy