app/controllers/api/v1/dashboard_controller.rb

      def index
        user_id = params[:user_id]
        @user = User.find(user_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]