app/controllers/api/v1/read_books_controller.rb

SELECT "read_books".* FROM "read_books"
---
      def index
        @read_books = ReadBook.all

INSERT INTO "read_books" ("user_id", "book_id", "month", "year", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 11], ["book_id", 25], ["month", 12], ["year", 2025], ["created_at", "2026-01-21 18:21:15.614363"], ["updated_at", "2026-01-21 18:21:15.614363"]]
---
      def create
        @read_book = ReadBook.new(read_book_params)
        if @read_book.save