app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("full_name", "email", "created_at", "updated_at", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "sign_in_count", "current_sign_in_at", "last_sign_in_at", "current_sign_in_ip", "last_sign_in_ip") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"
---
      def register
        @user = User.new(user_params)
        if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 56], ["LIMIT", 1]]
---
      def profile
        @user = User.find(params[:user_id])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 57], ["LIMIT", 1]]
UPDATE "users" SET "full_name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["full_name", "Updated Name"], ["updated_at", "2026-01-21 18:22:18.652559"], ["id", 57]]
---
      def update_profile
        @user = User.find(params[:user_id])
        if @user.update(user_update_params)