backend/app/controllers/api/v1/books_with_reviews_controller.rb

      def index
        @books = Book.select('books.id, books.title, books.summary, books.user_id, authors.id as author_id, authors.name as author_name, publishers.id as publisher_id, publishers.name as publisher_name, COUNT(book_reviews.id) as review_count, AVG(book_reviews.rating) as avg_rating')
                     .joins(:author, :publisher, :book_reviews)
                     .group('books.id', 'authors.id', 'publishers.id')
                     .order('review_count DESC')

        books_with_data = @books.map do |book|
          cover_url = book.box_cover.attached? ? book.box_cover.url : nil
          reviews = BookReview.where(book_id: book.id).limit(3).includes(:user)
          reviewers = reviews.map do |r|
---
SELECT books.id, books.title, books.summary, books.user_id, authors.id as author_id, authors.name as author_name, publishers.id as publisher_id, publishers.name as publisher_name, COUNT(book_reviews.id) as review_count, AVG(book_reviews.rating) as avg_rating FROM "books" INNER JOIN "authors" ON "authors"."id" = "books"."author_id" INNER JOIN "publishers" ON "publishers"."id" = "books"."publisher_id" INNER JOIN "book_reviews" ON "book_reviews"."book_id" = "books"."id" GROUP BY "books"."id", "authors"."id", "publishers"."id" ORDER BY review_count DESC
SELECT "book_reviews".* FROM "book_reviews" WHERE "book_reviews"."book_id" = $1 LIMIT $2  [["book_id", 10], ["LIMIT", 3]]
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2)  [["id", 1], ["id", 960]]