backend/app/controllers/api/v1/books_controller.rb

SELECT "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
SELECT "publishers".* FROM "publishers" WHERE "publishers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      def set_book
        @book = Book.includes(:author, :publisher).find(params[:id])