backend/app/controllers/api/v1/book_reviews_controller.rb

      def index
        if params[:book_id]
          @book = Book.find(params[:book_id])
          @book_reviews = @book.book_reviews.includes(:user)
        else
          @book_reviews = BookReview.all.includes(:user)
        end
        render json: @book_reviews.map { |review| format_review(review) }, status: :ok
---
SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
SELECT "book_reviews".* FROM "book_reviews" WHERE "book_reviews"."book_id" = $1  [["book_id", 12]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

      def create
        @book_review = current_user.book_reviews.new(review_params)
        if @book_review.save
---
INSERT INTO "book_reviews" ("rating", "review", "user_id", "book_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["rating", 8], ["review", "Great book!"], ["user_id", 7], ["book_id", 16], ["created_at", "2026-01-21 18:21:15.472940"], ["updated_at", "2026-01-21 18:21:15.472940"]]

      def destroy
        @book_review = current_user.book_reviews.find(params[:id])
        @book_review.destroy
---
SELECT "book_reviews".* FROM "book_reviews" WHERE "book_reviews"."user_id" = $1 AND "book_reviews"."id" = $2 LIMIT $3  [["user_id", 61], ["id", 4], ["LIMIT", 1]]
DELETE FROM "book_reviews" WHERE "book_reviews"."id" = $1  [["id", 24]]

      def recent
        limit = params[:limit]&.to_i || 10
        @book_reviews = BookReview.includes(:user, :book).order(created_at: :desc).limit(limit)
        render json: @book_reviews.map { |review| format_review_with_book(review) }, status: :ok
---
SELECT "book_reviews".* FROM "book_reviews" ORDER BY "book_reviews"."created_at" DESC LIMIT $1  [["LIMIT", 5]]
SELECT "read_books".* FROM "read_books" ORDER BY "read_books"."created_at" DESC LIMIT $1  [["LIMIT", 5]]
SELECT "users".* FROM "users" ORDER BY "users"."created_at" DESC LIMIT $1  [["LIMIT", 5]]
SELECT "books".* FROM "books" WHERE "books"."id" IN ($1, $2)  [["id", 10], ["id", 12]]
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2)  [["id", 960], ["id", 1]]