backend/app/controllers/api/v1/books_controller.rb

      def index
        @books = Book.includes(:author, :publisher).all
        books_with_cover = @books.map do |book|
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" IN ($1, $2, $3)  [["id", 1], ["id", 11], ["id", 205]]
SELECT "publishers".* FROM "publishers" WHERE "publishers"."id" IN ($1, $2, $3)  [["id", 1], ["id", 10], ["id", 205]]
SELECT "books".* FROM "books"

      def show
        @book = Book.includes(:author, :publisher).find(params[:id])
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
SELECT "publishers".* FROM "publishers" WHERE "publishers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

      def create
        @book = current_user.books.new(book_params)
        if @book.save
---
INSERT INTO "books" ("title", "original_title", "summary", "pages", "edition", "release_year", "author_id", "publisher_id", "created_at", "updated_at", "language_version") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"

      def update
        @book = Book.find(params[:id])
        if @book.update(book_params)
---
SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "books" SET "title" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["title", "Updated Title"], ["updated_at", "2026-01-21 18:16:36.594387"], ["id", 3]]

      def destroy
        @book = Book.find(params[:id])
        @book.destroy
---
SELECT "read_books".* FROM "read_books" WHERE "read_books"."book_id" = $1  [["book_id", 4]]
DELETE FROM "books" WHERE "books"."id" = $1  [["id", 4]]