backend/app/controllers/api/v1/book_review_comments_controller.rb

SELECT "book_review_comments".* FROM "book_review_comments" WHERE "book_review_comments"."book_review_id" = $1 AND "book_review_comments"."parent_id" IS NULL ORDER BY "book_review_comments"."created_at" ASC  [["book_review_id", 27]]
SELECT "book_reviews".* FROM "book_reviews" WHERE "book_reviews"."id" = $1 LIMIT $2  [["id", 27], ["LIMIT", 1]]
SELECT "book_review_comment_likes".* FROM "book_review_comment_likes" WHERE "book_review_comment_likes"."book_review_comment_id" = $1  [["book_review_comment_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1  [["id", 1]]
---
      def index
        comments = @book_review.book_review_comments
                               .includes(:user, :book_review_comment_likes,
                                         replies: %i[user book_review_comment_likes])
                               .where(parent_id: nil)
                               .order(created_at: :asc)

        render json: comments.map { |comment| format_comment(comment) }, status: :ok

INSERT INTO "book_review_comments" ("book_review_id", "user_id", "body", "parent_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
      def create
        comment = @book_review.book_review_comments.new(comment_params)
        comment.user = current_user

        if comment.save

INSERT INTO "book_review_comment_likes" ("book_review_comment_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["book_review_comment_id", 1], ["user_id", 1], ["created_at", "2026-02-04 15:12:02.245248"], ["updated_at", "2026-02-04 15:12:02.245248"]]
SELECT "book_review_comment_likes".* FROM "book_review_comment_likes" WHERE "book_review_comment_likes"."book_review_comment_id" = $1 AND "book_review_comment_likes"."user_id" = $2 LIMIT $3  [["book_review_comment_id", 1], ["user_id", 1], ["LIMIT", 1]]
---
      def like
        if @comment.user_id == current_user&.id
          return render json: { error: "Cannot like your own comment" }, status: :forbidden
        end

        @comment.book_review_comment_likes.find_or_create_by!(user: current_user)

SELECT "book_reviews".* FROM "book_reviews" WHERE "book_reviews"."id" = $1 LIMIT $2  [["id", 27], ["LIMIT", 1]]
---
      def set_book_review
        @book_review = BookReview.find(params[:book_review_id])

SELECT "book_review_comments".* FROM "book_review_comments" WHERE "book_review_comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      def set_comment
        @comment = BookReviewComment.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      def set_optional_user
        token = bearer_token
        return if token.blank?

        decoded_token = JsonWebToken.decode(token)
        @current_user = User.find_by(id: decoded_token[:user_id])

SELECT 1 AS one FROM "book_review_comment_likes" WHERE "book_review_comment_likes"."book_review_comment_id" = $1 AND "book_review_comment_likes"."user_id" = $2 LIMIT $3  [["book_review_comment_id", 1], ["user_id", 1], ["LIMIT", 1]]
SELECT "book_review_comments".* FROM "book_review_comments" WHERE "book_review_comments"."parent_id" = $1  [["parent_id", 1]]
SELECT COUNT(*) FROM "book_review_comment_likes" WHERE "book_review_comment_likes"."book_review_comment_id" = $1  [["book_review_comment_id", 1]]
---
      def format_comment(comment)
        liked = current_user.present? &&
          comment.book_review_comment_likes.exists?(user_id: current_user.id)

        {
          id: comment.id,
          body: comment.body,
          user_id: comment.user_id,
          user_name: comment.user&.full_name || "Anonymous",
          user_email: comment.user&.email,
          book_review_id: comment.book_review_id,
          parent_id: comment.parent_id,
          created_at: comment.created_at,
          updated_at: comment.updated_at,
          likes_count: comment.book_review_comment_likes.count,
          liked_by_current_user: liked,
          replies: comment.replies.sort_by(&:created_at).map { |reply| format_comment(reply) }

SELECT "book_review_comments".* FROM "book_review_comments" WHERE "book_review_comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "book_review_comment_likes" WHERE "book_review_comment_likes"."book_review_comment_id" = $1 AND "book_review_comment_likes"."user_id" = $2 LIMIT $3  [["book_review_comment_id", 1], ["user_id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "book_review_comment_likes" WHERE "book_review_comment_likes"."book_review_comment_id" = $1  [["book_review_comment_id", 1]]
---
      def like_payload(comment)
        comment.reload
        liked = current_user.present? &&
          comment.book_review_comment_likes.exists?(user_id: current_user.id)

        {
          id: comment.id,
          likes_count: comment.book_review_comment_likes.count,
          liked_by_current_user: liked