backend/app/controllers/api/v1/book_lists_controller.rb

      def index
        @book_lists = current_user.book_lists.includes(book: :author)
---
SELECT "book_lists".* FROM "book_lists" WHERE "book_lists"."user_id" = $1  [["user_id", 32]]

      def show_by_book
        @book_list = current_user.book_lists.find_by(book_id: params[:book_id])
---
SELECT "book_lists".* FROM "book_lists" WHERE "book_lists"."user_id" = $1 AND "book_lists"."book_id" = $2 LIMIT $3  [["user_id", 1], ["book_id", 12], ["LIMIT", 1]]

      def create
        @book_list = current_user.book_lists.find_or_initialize_by(book_id: book_list_params[:book_id])
        @book_list.assign_attributes(book_list_params)

        if @book_list.save
          create_read_book_if_finished(@book_list)
          status = @book_list.saved_change_to_id? ? :created : :ok
---
INSERT INTO "book_lists" ("user_id", "book_id", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 4], ["book_id", 13], ["status", "reading"], ["created_at", "2026-01-21 18:21:15.366434"], ["updated_at", "2026-01-21 18:21:15.366434"]]

      def update
        if @book_list.update(book_list_params)
---
UPDATE "book_lists" SET "status" = $1, "updated_at" = $2 WHERE "book_lists"."id" = $3  [["status", "finished"], ["updated_at", "2026-01-21 18:26:47.570365"], ["id", 19]]

      def destroy
        @book_list.destroy
---
DELETE FROM "book_lists" WHERE "book_lists"."id" = $1  [["id", 20]]

      def set_book_list
        @book_list = current_user.book_lists.find(params[:id])
---
SELECT "book_lists".* FROM "book_lists" WHERE "book_lists"."user_id" = $1 AND "book_lists"."id" = $2 LIMIT $3  [["user_id", 46], ["id", 5], ["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]

      def render_book_list(book_list, status: :ok)
        read_book = current_user.read_books
          .where(book_id: book_list.book_id)
          .order(year: :desc, month: :desc)
          .first
---
SELECT "read_books".* FROM "read_books" WHERE "read_books"."user_id" = $1 AND "read_books"."book_id" = $2 ORDER BY "read_books"."year" DESC, "read_books"."month" DESC LIMIT $3  [["user_id", 1], ["book_id", 12], ["LIMIT", 1]]