backend/app/controllers/api/v1/platform_statistics_controller.rb

SELECT COUNT(*) FROM "books"
SELECT "books".* FROM "books"
SELECT SUM("books"."pages") FROM "books"
---
      def index
        # Total books registered on the platform
        total_books = Book.count

        # Total pages summing all books
        total_pages = Book.sum(:pages) || 0

SELECT authors.id, authors.name, COUNT(read_books.id) as read_count FROM "read_books" INNER JOIN "books" ON "books"."id" = "read_books"."book_id" INNER JOIN "authors" ON "authors"."id" = "books"."author_id" GROUP BY "authors"."id", "authors"."name" ORDER BY read_count DESC LIMIT $1  [["LIMIT", 1]]
---
      def find_most_read_author
        # Find the author with the most books read by users
        author_reads = ReadBook.joins(book: :author)
          .group("authors.id", "authors.name")
          .select("authors.id, authors.name, COUNT(read_books.id) as read_count")
          .order("read_count DESC")
          .first

SELECT "authors".* FROM "authors" WHERE "authors"."id" IN ($1, $2)  [["id", 1], ["id", 11]]
SELECT "read_books".* FROM "read_books" ORDER BY "read_books"."created_at" DESC LIMIT $1  [["LIMIT", 5]]
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2)  [["id", 960], ["id", 1]]
---
      def find_recent_activities
        # Get the last 5 books read by users with details
        ReadBook.includes(:user, book: [:author])
          .order(created_at: :desc)
          .limit(5)
          .map do |read_book|

SELECT "users".* FROM "users" ORDER BY "users"."created_at" DESC LIMIT $1  [["LIMIT", 5]]
SELECT COUNT(*) FROM "books" WHERE "books"."user_id" = $1  [["user_id", 960]]
SELECT COUNT(*) FROM "book_reviews" WHERE "book_reviews"."user_id" = $1  [["user_id", 1]]
---
      def find_recent_users
        # Get the last 5 users registered with their stats
        User.order(created_at: :desc)
          .limit(5)
          .map do |user|
            books_count = user.books.count
            reviews_count = user.book_reviews.count