backend/app/controllers/api/v1/publishers_controller.rb

      def index
        @publishers = Publisher.all
---
SELECT "publishers".* FROM "publishers"

      def show
        @publisher = Publisher.find(params[:id])
---
SELECT "publishers".* FROM "publishers" WHERE "publishers"."id" = $1 LIMIT $2  [["id", 129], ["LIMIT", 1]]

      def create
        @publisher = current_user.publishers.new(publisher_params)
        if @publisher.save
---
INSERT INTO "publishers" ("name", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Suma2"], ["created_at", "2026-01-23 15:29:12.145786"], ["updated_at", "2026-01-23 15:29:12.145786"], ["user_id", 4]]

      def update
        @publisher = Publisher.find(params[:id])
        if @publisher.update(publisher_params)
---
SELECT "publishers".* FROM "publishers" WHERE "publishers"."id" = $1 LIMIT $2  [["id", 131], ["LIMIT", 1]]
UPDATE "publishers" SET "name" = $1, "updated_at" = $2 WHERE "publishers"."id" = $3  [["name", "Updated Name"], ["updated_at", "2026-01-21 18:26:47.980208"], ["id", 131]]

      def destroy
        @publisher = Publisher.find(params[:id])
        @publisher.destroy
---
SELECT "publishers".* FROM "publishers" WHERE "publishers"."id" = $1 LIMIT $2  [["id", 132], ["LIMIT", 1]]
DELETE FROM "publishers" WHERE "publishers"."id" = $1  [["id", 132]]