backend/app/controllers/api/v1/subscriptions_controller.rb

SELECT "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."user_id" = $1 LIMIT $2  [["user_id", 115], ["LIMIT", 1]]
---
      def show
        # Accept "current" to get the authenticated user's subscription
        if params[:id] == "current"
          @subscription = current_user.subscription
        else
          @subscription = Subscription.find(params[:id])

INSERT INTO "subscriptions" ("user_id", "stripe_id", "status", "current_period_start", "current_period_end", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
      def create
        @subscription = current_user.subscription || current_user.build_subscription
        @subscription.assign_attributes(subscription_params)

        if @subscription.save