app/controllers/application_controller.rb

  def authenticate_user!
    token = bearer_token
    return render json: { error: "Unauthorized" }, status: :unauthorized if token.blank?

    decoded_token = JsonWebToken.decode(token)
    @current_user = User.find(decoded_token[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]